----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,472
         MaxPool2d-2           [-1, 64, 56, 56]               0
            Conv2d-3           [-1, 64, 56, 56]           4,160
            Conv2d-4          [-1, 192, 56, 56]         110,784
         MaxPool2d-5          [-1, 192, 28, 28]               0
            Conv2d-6           [-1, 64, 28, 28]          12,352
            Conv2d-7           [-1, 96, 28, 28]          18,528
            Conv2d-8          [-1, 128, 28, 28]         110,720
            Conv2d-9           [-1, 16, 28, 28]           3,088
           Conv2d-10           [-1, 32, 28, 28]          12,832
        MaxPool2d-11          [-1, 192, 28, 28]               0
           Conv2d-12           [-1, 32, 28, 28]           6,176
        Inception-13          [-1, 256, 28, 28]               0
           Conv2d-14          [-1, 128, 28, 28]          32,896
           Conv2d-15          [-1, 128, 28, 28]          32,896
           Conv2d-16          [-1, 192, 28, 28]         221,376
           Conv2d-17           [-1, 32, 28, 28]           8,224
           Conv2d-18           [-1, 96, 28, 28]          76,896
        MaxPool2d-19          [-1, 256, 28, 28]               0
           Conv2d-20           [-1, 64, 28, 28]          16,448
        Inception-21          [-1, 480, 28, 28]               0
        MaxPool2d-22          [-1, 480, 14, 14]               0
           Conv2d-23          [-1, 192, 14, 14]          92,352
           Conv2d-24           [-1, 96, 14, 14]          46,176
           Conv2d-25          [-1, 208, 14, 14]         179,920
           Conv2d-26           [-1, 16, 14, 14]           7,696
           Conv2d-27           [-1, 48, 14, 14]          19,248
        MaxPool2d-28          [-1, 480, 14, 14]               0
           Conv2d-29           [-1, 64, 14, 14]          30,784
        Inception-30          [-1, 512, 14, 14]               0
        AvgPool2d-31            [-1, 512, 4, 4]               0
           Conv2d-32            [-1, 128, 4, 4]          65,664
           Linear-33                 [-1, 1024]       2,098,176
           Linear-34                 [-1, 1000]       1,025,000
AuxiliaryClassifier-35                 [-1, 1000]               0
           Conv2d-36          [-1, 160, 14, 14]          82,080
           Conv2d-37          [-1, 112, 14, 14]          57,456
           Conv2d-38          [-1, 224, 14, 14]         226,016
           Conv2d-39           [-1, 24, 14, 14]          12,312
           Conv2d-40           [-1, 64, 14, 14]          38,464
        MaxPool2d-41          [-1, 512, 14, 14]               0
           Conv2d-42           [-1, 64, 14, 14]          32,832
        Inception-43          [-1, 512, 14, 14]               0
           Conv2d-44          [-1, 128, 14, 14]          65,664
           Conv2d-45          [-1, 128, 14, 14]          65,664
           Conv2d-46          [-1, 256, 14, 14]         295,168
           Conv2d-47           [-1, 24, 14, 14]          12,312
           Conv2d-48           [-1, 64, 14, 14]          38,464
        MaxPool2d-49          [-1, 512, 14, 14]               0
           Conv2d-50           [-1, 64, 14, 14]          32,832
        Inception-51          [-1, 512, 14, 14]               0
           Conv2d-52          [-1, 112, 14, 14]          57,456
           Conv2d-53          [-1, 144, 14, 14]          73,872
           Conv2d-54          [-1, 288, 14, 14]         373,536
           Conv2d-55           [-1, 32, 14, 14]          16,416
           Conv2d-56           [-1, 64, 14, 14]          51,264
        MaxPool2d-57          [-1, 512, 14, 14]               0
           Conv2d-58           [-1, 64, 14, 14]          32,832
        Inception-59          [-1, 528, 14, 14]               0
        AvgPool2d-60            [-1, 528, 4, 4]               0
           Conv2d-61            [-1, 128, 4, 4]          67,712
           Linear-62                 [-1, 1024]       2,098,176
           Linear-63                 [-1, 1000]       1,025,000
AuxiliaryClassifier-64                 [-1, 1000]               0
           Conv2d-65          [-1, 256, 14, 14]         135,424
           Conv2d-66          [-1, 160, 14, 14]          84,640
           Conv2d-67          [-1, 320, 14, 14]         461,120
           Conv2d-68           [-1, 32, 14, 14]          16,928
           Conv2d-69          [-1, 128, 14, 14]         102,528
        MaxPool2d-70          [-1, 528, 14, 14]               0
           Conv2d-71          [-1, 128, 14, 14]          67,712
        Inception-72          [-1, 832, 14, 14]               0
        MaxPool2d-73            [-1, 832, 7, 7]               0
           Conv2d-74            [-1, 256, 7, 7]         213,248
           Conv2d-75            [-1, 160, 7, 7]         133,280
           Conv2d-76            [-1, 320, 7, 7]         461,120
           Conv2d-77             [-1, 32, 7, 7]          26,656
           Conv2d-78            [-1, 128, 7, 7]         102,528
        MaxPool2d-79            [-1, 832, 7, 7]               0
           Conv2d-80            [-1, 128, 7, 7]         106,624
        Inception-81            [-1, 832, 7, 7]               0
           Conv2d-82            [-1, 384, 7, 7]         319,872
           Conv2d-83            [-1, 192, 7, 7]         159,936
           Conv2d-84            [-1, 384, 7, 7]         663,936
           Conv2d-85             [-1, 48, 7, 7]          39,984
           Conv2d-86            [-1, 128, 7, 7]         153,728
        MaxPool2d-87            [-1, 832, 7, 7]               0
           Conv2d-88            [-1, 128, 7, 7]         106,624
        Inception-89           [-1, 1024, 7, 7]               0
AdaptiveAvgPool2d-90           [-1, 1024, 1, 1]               0
          Dropout-91                 [-1, 1024]               0
           Linear-92                 [-1, 1000]       1,025,000
================================================================
Total params: 13,378,280
Trainable params: 13,378,280
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 45.08
Params size (MB): 51.03
Estimated Total Size (MB): 96.69
----------------------------------------------------------------
